Revit 2024 API
RoutingConditions Class
 RoutingConditions contain routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class RoutingConditions : IDisposable
Visual Basic
Public Class RoutingConditions _
	Implements IDisposable
Visual C++
public ref class RoutingConditions : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.RoutingConditions
See Also
RoutingConditions Members
Autodesk.Revit.DB Namespace